##  Managers with at Least 5 Direct Reports Leetcode Task29

In [27]:
import pandas as pd
import numpy as np

In [186]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
Employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})

In [165]:
Employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [187]:
direct_reports_count = Employee.groupby('managerId').size().reset_index(name='num_direct_reports')
direct_reports_count

   managerId  num_direct_reports
0        101                   5

In [188]:
managers_with_at_least_5_reports = direct_reports_count[direct_reports_count['num_direct_reports'] >= 5]
managers_with_at_least_5_reports

   managerId  num_direct_reports
0        101                   5

In [189]:
result = managers_with_at_least_5_reports.merge(Employee, left_on='managerId', right_on='id', how='inner')['name']
result

0    John
Name: name, dtype: object

In [190]:
pd.DataFrame({'name':result})

   name
0  John